Ralim/IronOS/source/Core/BSP/Magic/bl_mcu_sdk/drivers/bl602_driver/regs/spi_reg.h
/* 0x10 : spi_prd_0 */
#define SPI_PRD_0_OFFSET           (0x10)
#define SPI_CR_SPI_PRD_S           SPI_CR_SPI_PRD_S
#define SPI_CR_SPI_PRD_S_POS       (0U)
#define SPI_CR_SPI_PRD_S_LEN       (8U)
#define SPI_CR_SPI_PRD_S_MSK       (((1U << SPI_CR_SPI_PRD_S_LEN) - 1) << SPI_CR_SPI_PRD_S_POS)
#define SPI_CR_SPI_PRD_S_UMSK      (~(((1U << SPI_CR_SPI_PRD_S_LEN) - 1) << SPI_CR_SPI_PRD_S_POS))
#define SPI_CR_SPI_PRD_P           SPI_CR_SPI_PRD_P
#define SPI_CR_SPI_PRD_P_POS       (8U)
#define SPI_CR_SPI_PRD_P_LEN       (8U)
#define SPI_CR_SPI_PRD_P_MSK       (((1U << SPI_CR_SPI_PRD_P_LEN) - 1) << SPI_CR_SPI_PRD_P_POS)
#define SPI_CR_SPI_PRD_P_UMSK      (~(((1U << SPI_CR_SPI_PRD_P_LEN) - 1) << SPI_CR_SPI_PRD_P_POS))
#define SPI_CR_SPI_PRD_D_PH_0      SPI_CR_SPI_PRD_D_PH_0
#define SPI_CR_SPI_PRD_D_PH_0_POS  (16U)
#define SPI_CR_SPI_PRD_D_PH_0_LEN  (8U)
#define SPI_CR_SPI_PRD_D_PH_0_MSK  (((1U << SPI_CR_SPI_PRD_D_PH_0_LEN) - 1) << SPI_CR_SPI_PRD_D_PH_0_POS)
#define SPI_CR_SPI_PRD_D_PH_0_UMSK (~(((1U << SPI_CR_SPI_PRD_D_PH_0_LEN) - 1) << SPI_CR_SPI_PRD_D_PH_0_POS))
#define SPI_CR_SPI_PRD_D_PH_1      SPI_CR_SPI_PRD_D_PH_1
#define SPI_CR_SPI_PRD_D_PH_1_POS  (24U)
#define SPI_CR_SPI_PRD_D_PH_1_LEN  (8U)
#define SPI_CR_SPI_PRD_D_PH_1_MSK  (((1U << SPI_CR_SPI_PRD_D_PH_1_LEN) - 1) << SPI_CR_SPI_PRD_D_PH_1_POS)
#define SPI_CR_SPI_PRD_D_PH_1_UMSK (~(((1U << SPI_CR_SPI_PRD_D_PH_1_LEN) - 1) << SPI_CR_SPI_PRD_D_PH_1_POS))

/* 0x14 : spi_prd_1 */
#define SPI_PRD_1_OFFSET      (0x14)
#define SPI_CR_SPI_PRD_I      SPI_CR_SPI_PRD_I
#define SPI_CR_SPI_PRD_I_POS  (0U)
#define SPI_CR_SPI_PRD_I_LEN  (8U)
#define SPI_CR_SPI_PRD_I_MSK  (((1U << SPI_CR_SPI_PRD_I_LEN) - 1) << SPI_CR_SPI_PRD_I_POS)
#define SPI_CR_SPI_PRD_I_UMSK (~(((1U << SPI_CR_SPI_PRD_I_LEN) - 1) << SPI_CR_SPI_PRD_I_POS))

/* 0x18 : spi_rxd_ignr */
#define SPI_RXD_IGNR_OFFSET        (0x18)
#define SPI_CR_SPI_RXD_IGNR_P      SPI_CR_SPI_RXD_IGNR_P
#define SPI_CR_SPI_RXD_IGNR_P_POS  (0U)
#define SPI_CR_SPI_RXD_IGNR_P_LEN  (5U)
#define SPI_CR_SPI_RXD_IGNR_P_MSK  (((1U << SPI_CR_SPI_RXD_IGNR_P_LEN) - 1) << SPI_CR_SPI_RXD_IGNR_P_POS)
#define SPI_CR_SPI_RXD_IGNR_P_UMSK (~(((1U << SPI_CR_SPI_RXD_IGNR_P_LEN) - 1) << SPI_CR_SPI_RXD_IGNR_P_POS))
#define SPI_CR_SPI_RXD_IGNR_S      SPI_CR_SPI_RXD_IGNR_S
#define SPI_CR_SPI_RXD_IGNR_S_POS  (16U)
#define SPI_CR_SPI_RXD_IGNR_S_LEN  (5U)
#define SPI_CR_SPI_RXD_IGNR_S_MSK  (((1U << SPI_CR_SPI_RXD_IGNR_S_LEN) - 1) << SPI_CR_SPI_RXD_IGNR_S_POS)
#define SPI_CR_SPI_RXD_IGNR_S_UMSK (~(((1U << SPI_CR_SPI_RXD_IGNR_S_LEN) - 1) << SPI_CR_SPI_RXD_IGNR_S_POS))

/* 0x1C : spi_sto_value */
#define SPI_STO_VALUE_OFFSET      (0x1C)
#define SPI_CR_SPI_STO_VALUE      SPI_CR_SPI_STO_VALUE
#define SPI_CR_SPI_STO_VALUE_POS  (0U)
#define SPI_CR_SPI_STO_VALUE_LEN  (12U)
#define SPI_CR_SPI_STO_VALUE_MSK  (((1U << SPI_CR_SPI_STO_VALUE_LEN) - 1) << SPI_CR_SPI_STO_VALUE_POS)
#define SPI_CR_SPI_STO_VALUE_UMSK (~(((1U << SPI_CR_SPI_STO_VALUE_LEN) - 1) << SPI_CR_SPI_STO_VALUE_POS))

/* 0x80 : spi_fifo_config_0 */
#define SPI_FIFO_CONFIG_0_OFFSET   (0x80)
#define SPI_DMA_TX_EN              SPI_DMA_TX_EN
#define SPI_DMA_TX_EN_POS          (0U)
#define SPI_DMA_TX_EN_LEN          (1U)
#define SPI_DMA_TX_EN_MSK          (((1U << SPI_DMA_TX_EN_LEN) - 1) << SPI_DMA_TX_EN_POS)
#define SPI_DMA_TX_EN_UMSK         (~(((1U << SPI_DMA_TX_EN_LEN) - 1) << SPI_DMA_TX_EN_POS))
#define SPI_DMA_RX_EN              SPI_DMA_RX_EN
#define SPI_DMA_RX_EN_POS          (1U)
#define SPI_DMA_RX_EN_LEN          (1U)
#define SPI_DMA_RX_EN_MSK          (((1U << SPI_DMA_RX_EN_LEN) - 1) << SPI_DMA_RX_EN_POS)
#define SPI_DMA_RX_EN_UMSK         (~(((1U << SPI_DMA_RX_EN_LEN) - 1) << SPI_DMA_RX_EN_POS))
#define SPI_TX_FIFO_CLR            SPI_TX_FIFO_CLR
#define SPI_TX_FIFO_CLR_POS        (2U)
#define SPI_TX_FIFO_CLR_LEN        (1U)
#define SPI_TX_FIFO_CLR_MSK        (((1U << SPI_TX_FIFO_CLR_LEN) - 1) << SPI_TX_FIFO_CLR_POS)
#define SPI_TX_FIFO_CLR_UMSK       (~(((1U << SPI_TX_FIFO_CLR_LEN) - 1) << SPI_TX_FIFO_CLR_POS))
#define SPI_RX_FIFO_CLR            SPI_RX_FIFO_CLR
#define SPI_RX_FIFO_CLR_POS        (3U)
#define SPI_RX_FIFO_CLR_LEN        (1U)
#define SPI_RX_FIFO_CLR_MSK        (((1U << SPI_RX_FIFO_CLR_LEN) - 1) << SPI_RX_FIFO_CLR_POS)
#define SPI_RX_FIFO_CLR_UMSK       (~(((1U << SPI_RX_FIFO_CLR_LEN) - 1) << SPI_RX_FIFO_CLR_POS))
#define SPI_TX_FIFO_OVERFLOW       SPI_TX_FIFO_OVERFLOW
#define SPI_TX_FIFO_OVERFLOW_POS   (4U)
#define SPI_TX_FIFO_OVERFLOW_LEN   (1U)
#define SPI_TX_FIFO_OVERFLOW_MSK   (((1U << SPI_TX_FIFO_OVERFLOW_LEN) - 1) << SPI_TX_FIFO_OVERFLOW_POS)
#define SPI_TX_FIFO_OVERFLOW_UMSK  (~(((1U << SPI_TX_FIFO_OVERFLOW_LEN) - 1) << SPI_TX_FIFO_OVERFLOW_POS))
#define SPI_TX_FIFO_UNDERFLOW      SPI_TX_FIFO_UNDERFLOW
#define SPI_TX_FIFO_UNDERFLOW_POS  (5U)
#define SPI_TX_FIFO_UNDERFLOW_LEN  (1U)
#define SPI_TX_FIFO_UNDERFLOW_MSK  (((1U << SPI_TX_FIFO_UNDERFLOW_LEN) - 1) << SPI_TX_FIFO_UNDERFLOW_POS)
#define SPI_TX_FIFO_UNDERFLOW_UMSK (~(((1U << SPI_TX_FIFO_UNDERFLOW_LEN) - 1) << SPI_TX_FIFO_UNDERFLOW_POS))
#define SPI_RX_FIFO_OVERFLOW       SPI_RX_FIFO_OVERFLOW
#define SPI_RX_FIFO_OVERFLOW_POS   (6U)
#define SPI_RX_FIFO_OVERFLOW_LEN   (1U)
#define SPI_RX_FIFO_OVERFLOW_MSK   (((1U << SPI_RX_FIFO_OVERFLOW_LEN) - 1) << SPI_RX_FIFO_OVERFLOW_POS)
#define SPI_RX_FIFO_OVERFLOW_UMSK  (~(((1U << SPI_RX_FIFO_OVERFLOW_LEN) - 1) << SPI_RX_FIFO_OVERFLOW_POS))
#define SPI_RX_FIFO_UNDERFLOW      SPI_RX_FIFO_UNDERFLOW
#define SPI_RX_FIFO_UNDERFLOW_POS  (7U)
#define SPI_RX_FIFO_UNDERFLOW_LEN  (1U)
#define SPI_RX_FIFO_UNDERFLOW_MSK  (((1U << SPI_RX_FIFO_UNDERFLOW_LEN) - 1) << SPI_RX_FIFO_UNDERFLOW_POS)
#define SPI_RX_FIFO_UNDERFLOW_UMSK (~(((1U << SPI_RX_FIFO_UNDERFLOW_LEN) - 1) << SPI_RX_FIFO_UNDERFLOW_POS))

/* 0x84 : spi_fifo_config_1 */
#define SPI_FIFO_CONFIG_1_OFFSET (0x84)
#define SPI_TX_FIFO_CNT          SPI_TX_FIFO_CNT
#define SPI_TX_FIFO_CNT_POS      (0U)
#define SPI_TX_FIFO_CNT_LEN      (3U)
#define SPI_TX_FIFO_CNT_MSK      (((1U << SPI_TX_FIFO_CNT_LEN) - 1) << SPI_TX_FIFO_CNT_POS)
#define SPI_TX_FIFO_CNT_UMSK     (~(((1U << SPI_TX_FIFO_CNT_LEN) - 1) << SPI_TX_FIFO_CNT_POS))
#define SPI_RX_FIFO_CNT          SPI_RX_FIFO_CNT
#define SPI_RX_FIFO_CNT_POS      (8U)
#define SPI_RX_FIFO_CNT_LEN      (3U)
#define SPI_RX_FIFO_CNT_MSK      (((1U << SPI_RX_FIFO_CNT_LEN) - 1) << SPI_RX_FIFO_CNT_POS)
#define SPI_RX_FIFO_CNT_UMSK     (~(((1U << SPI_RX_FIFO_CNT_LEN) - 1) << SPI_RX_FIFO_CNT_POS))
#define SPI_TX_FIFO_TH           SPI_TX_FIFO_TH
#define SPI_TX_FIFO_TH_POS       (16U)
#define SPI_TX_FIFO_TH_LEN       (2U)
#define SPI_TX_FIFO_TH_MSK       (((1U << SPI_TX_FIFO_TH_LEN) - 1) << SPI_TX_FIFO_TH_POS)
#define SPI_TX_FIFO_TH_UMSK      (~(((1U << SPI_TX_FIFO_TH_LEN) - 1) << SPI_TX_FIFO_TH_POS))
#define SPI_RX_FIFO_TH           SPI_RX_FIFO_TH
#define SPI_RX_FIFO_TH_POS       (24U)
#define SPI_RX_FIFO_TH_LEN       (2U)
#define SPI_RX_FIFO_TH_MSK       (((1U << SPI_RX_FIFO_TH_LEN) - 1) << SPI_RX_FIFO_TH_POS)
#define SPI_RX_FIFO_TH_UMSK      (~(((1U << SPI_RX_FIFO_TH_LEN) - 1) << SPI_RX_FIFO_TH_POS))

/* 0x88 : spi_fifo_wdata */
#define SPI_FIFO_WDATA_OFFSET (0x88)
#define SPI_FIFO_WDATA        SPI_FIFO_WDATA
#define SPI_FIFO_WDATA_POS    (0U)
#define SPI_FIFO_WDATA_LEN    (32U)
#define SPI_FIFO_WDATA_MSK    (((1U << SPI_FIFO_WDATA_LEN) - 1) << SPI_FIFO_WDATA_POS)
#define SPI_FIFO_WDATA_UMSK   (~(((1U << SPI_FIFO_WDATA_LEN) - 1) << SPI_FIFO_WDATA_POS))

/* 0x8C : spi_fifo_rdata */
#define SPI_FIFO_RDATA_OFFSET (0x8C)
#define SPI_FIFO_RDATA        SPI_FIFO_RDATA
#define SPI_FIFO_RDATA_POS    (0U)
#define SPI_FIFO_RDATA_LEN    (32U)
#define SPI_FIFO_RDATA_MSK    (((1U << SPI_FIFO_RDATA_LEN) - 1) << SPI_FIFO_RDATA_POS)
#define SPI_FIFO_RDATA_UMSK   (~(((1U << SPI_FIFO_RDATA_LEN) - 1) << SPI_FIFO_RDATA_POS))

struct spi_reg {
    /* 0x0 : spi_config */
    union {
        struct
        {
            uint32_t cr_spi_m_en        : 1;  /* [    0],        r/w,        0x0 */
            uint32_t cr_spi_s_en        : 1;  /* [    1],        r/w,        0x0 */
            uint32_t cr_spi_frame_size  : 2;  /* [ 3: 2],        r/w,        0x0 */
            uint32_t cr_spi_sclk_pol    : 1;  /* [    4],        r/w,        0x0 */
            uint32_t cr_spi_sclk_ph     : 1;  /* [    5],        r/w,        0x0 */
            uint32_t cr_spi_bit_inv     : 1;  /* [    6],        r/w,        0x0 */
            uint32_t cr_spi_byte_inv    : 1;  /* [    7],        r/w,        0x0 */
            uint32_t cr_spi_rxd_ignr_en : 1;  /* [    8],        r/w,        0x0 */
            uint32_t cr_spi_m_cont_en   : 1;  /* [    9],        r/w,        0x0 */
            uint32_t reserved_10        : 1;  /* [   10],       rsvd,        0x0 */
            uint32_t cr_spi_deg_en      : 1;  /* [   11],        r/w,        0x0 */
            uint32_t cr_spi_deg_cnt     : 4;  /* [15:12],        r/w,        0x0 */
            uint32_t reserved_16_31     : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } spi_config;

    /* 0x4 : spi_int_sts */
    union {
        struct
        {
            uint32_t spi_end_int     : 1; /* [    0],          r,        0x0 */
            uint32_t spi_txf_int     : 1; /* [    1],          r,        0x0 */
            uint32_t spi_rxf_int     : 1; /* [    2],          r,        0x0 */
            uint32_t spi_sto_int     : 1; /* [    3],          r,        0x0 */
            uint32_t spi_txu_int     : 1; /* [    4],          r,        0x0 */
            uint32_t spi_fer_int     : 1; /* [    5],          r,        0x0 */
            uint32_t reserved_6_7    : 2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t cr_spi_end_mask : 1; /* [    8],        r/w,        0x1 */
            uint32_t cr_spi_txf_mask : 1; /* [    9],        r/w,        0x1 */
            uint32_t cr_spi_rxf_mask : 1; /* [   10],        r/w,        0x1 */
            uint32_t cr_spi_sto_mask : 1; /* [   11],        r/w,        0x1 */
            uint32_t cr_spi_txu_mask : 1; /* [   12],        r/w,        0x1 */
            uint32_t cr_spi_fer_mask : 1; /* [   13],        r/w,        0x1 */
            uint32_t reserved_14_15  : 2; /* [15:14],       rsvd,        0x0 */
            uint32_t cr_spi_end_clr  : 1; /* [   16],        w1c,        0x0 */
            uint32_t rsvd_17         : 1; /* [   17],       rsvd,        0x0 */
            uint32_t rsvd_18         : 1; /* [   18],       rsvd,        0x0 */
            uint32_t cr_spi_sto_clr  : 1; /* [   19],        w1c,        0x0 */
            uint32_t cr_spi_txu_clr  : 1; /* [   20],        w1c,        0x0 */
            uint32_t rsvd_21         : 1; /* [   21],       rsvd,        0x0 */
            uint32_t reserved_22_23  : 2; /* [23:22],       rsvd,        0x0 */
            uint32_t cr_spi_end_en   : 1; /* [   24],        r/w,        0x1 */
            uint32_t cr_spi_txf_en   : 1; /* [   25],        r/w,        0x1 */
            uint32_t cr_spi_rxf_en   : 1; /* [   26],        r/w,        0x1 */
            uint32_t cr_spi_sto_en   : 1; /* [   27],        r/w,        0x1 */
            uint32_t cr_spi_txu_en   : 1; /* [   28],        r/w,        0x1 */
            uint32_t cr_spi_fer_en   : 1; /* [   29],        r/w,        0x1 */
            uint32_t reserved_30_31  : 2; /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } spi_int_sts;

    /* 0x8 : spi_bus_busy */
    union {
        struct
        {
            uint32_t sts_spi_bus_busy : 1;  /* [    0],          r,        0x0 */
            uint32_t reserved_1_31    : 31; /* [31: 1],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } spi_bus_busy;

